server/app/controllers/api/v1/feedbacks_controller.rb

SELECT `feedbacks`.* FROM `feedbacks` ORDER BY created_at DESC
---
            def index
                # Rails requires the file name to match the class name.
                # Therefore file name should be 'feedbacks_controller.rb'
                feedbacks = Feedback.order('created_at DESC')

SELECT `feedbacks`.* FROM `feedbacks` WHERE `feedbacks`.`id` = 3 LIMIT 1
---
            def show
                feedback = Feedback.find(params[:id])

INSERT INTO `feedbacks` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('tester', 'testtitle', 'testbody', '2022-01-20 15:18:38.986300', '2022-01-20 15:18:38.986300')
---
            def create
                feedback = Feedback.new(feedback_params)

                if feedback.save

SELECT `feedbacks`.* FROM `feedbacks` WHERE `feedbacks`.`id` = 5 LIMIT 1
DELETE FROM `feedbacks` WHERE `feedbacks`.`id` = 5
---
            def destroy
                feedback = Feedback.find(params[:id])
                feedback.destroy

SELECT `feedbacks`.* FROM `feedbacks` WHERE `feedbacks`.`id` = 5 LIMIT 1
UPDATE `feedbacks` SET `feedbacks`.`name` = 'updatedname', `feedbacks`.`title` = 'updatedtitle', `feedbacks`.`body` = 'updatedbody', `feedbacks`.`updated_at` = '2022-01-20 15:33:22.044607' WHERE `feedbacks`.`id` = 3
---
            def update
                feedback = Feedback.find(params[:id])
                # use update(...) instead of update_attributes(...)
                if feedback.update(feedback_params)